## Production: system_status
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 17 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                           NAME                                           |
|--------|------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.system_status_testing[0]`                                     |
|        | `aws_cloudwatch_event_target.system_status[0]`                                           |
|        | `aws_cloudwatch_log_group.system_status_log_group[0]`                                    |
|        | `aws_cloudwatch_log_metric_filter.system_status-500-errors-api[0]`                       |
|        | `aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-system_status-api[0]`     |
|        | `aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-system_status-api[0]`  |
|        | `aws_lambda_function_event_invoke_config.system_status_invoke_config`                    |
|        | `aws_lambda_permission.allow_cloudwatch[0]`                                              |
|        | `module.system_status.aws_cloudwatch_log_group.this`                                     |
|        | `module.system_status.aws_iam_policy.policies[0]`                                        |
|        | `module.system_status.aws_iam_policy.vpc_policies[0]`                                    |
|        | `module.system_status.aws_iam_role.this`                                                 |
|        | `module.system_status.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0]` |
|        | `module.system_status.aws_iam_role_policy_attachment.attachments[0]`                     |
|        | `module.system_status.aws_iam_role_policy_attachment.lambda_insights[0]`                 |
|        | `module.system_status.aws_iam_role_policy_attachment.vpc_policies[0]`                    |
|        | `module.system_status.aws_lambda_function.this`                                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.system_status_testing[0] will be created
  + resource "aws_cloudwatch_event_rule" "system_status_testing" {
      + arn                 = (known after apply)
      + description         = "system_status_testing event rule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "system_status_testing"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.system_status[0] will be created
  + resource "aws_cloudwatch_event_target" "system_status" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.system_status_log_group[0] will be created
  + resource "aws_cloudwatch_log_group" "system_status_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "system_status_log_group"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
        }
      + tags_all          = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
        }
    }

  # aws_cloudwatch_log_metric_filter.system_status-500-errors-api[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "system_status-500-errors-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/system_status"
      + name           = "system_status-500-errors-api"
      + pattern        = "\"\\\"levelname\\\": \\\"ERROR\\\"\""

      + metric_transformation {
          + name      = "500-errors-system_status-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-system_status-api[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-system_status-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One 500 error in 1 minute for system_status api"
      + alarm_name                            = "logs-1-500-error-1-minute-warning-system_status-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-system_status-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-system_status-api[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-system_status-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Ten 500 errors in 5 minutes for system_status api"
      + alarm_name                            = "logs-10-500-error-5-minutes-critical-system_status-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-system_status-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_lambda_function_event_invoke_config.system_status_invoke_config will be created
  + resource "aws_lambda_function_event_invoke_config" "system_status_invoke_config" {
      + function_name                = "system_status"
      + id                           = (known after apply)
      + maximum_event_age_in_seconds = 120
      + maximum_retry_attempts       = 0
    }

  # aws_lambda_permission.allow_cloudwatch[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "system_status"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.system_status.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/system_status"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.system_status.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "system_status-0"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-production-system-status/*",
                          + "arn:aws:s3:::notification-canada-ca-production-system-status",
                        ]
                      + Sid      = "AllowS3Access"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.system_status.aws_iam_policy.vpc_policies[0] will be created
  + resource "aws_iam_policy" "vpc_policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "system_status_vpc"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/heartbeat"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.system_status.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "system_status"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.system_status.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "system_status"
    }

  # module.system_status.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "system_status"
    }

  # module.system_status.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "system_status"
    }

  # module.system_status.aws_iam_role_policy_attachment.vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "system_status"
    }

  # module.system_status.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "system_status"
      + id                             = (known after apply)
      + image_uri                      = "296255494825.dkr.ecr.ca-central-1.amazonaws.com/notify/system_status:bootstrap"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "sqlalchemy_database_reader_uri" = (sensitive value)
              + "system_status_admin_url"        = "https://notification.canada.ca"
              + "system_status_api_url"          = "https://api.notification.canada.ca"
              + "system_status_bucket_name"      = "notification-canada-ca-production-system-status"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-09e3175f46bc85607",
            ]
          + subnet_ids                  = [
              + "subnet-003252752c8a83c9f",
              + "subnet-0372dd9f5c68cdf14",
              + "subnet-0c68946095ba18faf",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

